//###########################################################################
//
// FILE:   MainCPU-Main.h
//
// TITLE:  Объявление глобальных переменных
//
//###########################################################################

#ifndef MAINCPU_MAIN_H
#define MAINCPU_MAIN_H


////////////////////// ПОДКЛЮЧЕНИЕ ЗАГОЛОВОЧНЫХ ФАЙЛОВ //////////////////////
// подключение заголовочного файла "PeripheralHeaderIncludes.h"
#include "PeripheralHeaderIncludes.h"


/////////////////////////// ОБЪЯВЛЕНИЕ ПЕРЕМЕННЫХ ///////////////////////////
// память параметров преобразователя частоты (общая память)
Rpd_Ctrl_Regs_S rpd_ctrl_regs;
// память параметров преобразователя частоты  (память модели)
Data_PMSM_S data_pmsm;
// общая память флагов преобразователя частоты
Flg_Cntrl_Drive_S flags_drive;
// структура данных сервисных параметров  modbus'а
MB_Servc mb_servc;
// указатель на память modbus
Uint16 	*pMBmemory;
// счётчик отображения семисегментного индикатора
Uint16 cnt_vdhl;
// объявление структуры просмотра параметров
Brws_Param_Drive brwsr;


#endif  // end of MAINCPU_MAIN_H definition

//===========================================================================
// End of file.
//===========================================================================
