//###########################################################################
//
// Файл:    	MainSetting.h
//
// Описание:   	Заголовочный файл MainSetting.c
//
//###########################################################################


#ifndef MAINSETTING_H_
#define MAINSETTING_H_


////////////////////// ОБЪЯВЛЕНИЕ ИМЕНОВАННЫХ КОНСТАНТ //////////////////////
// константа коэфициент преобразования значения из 12 битного значения
#define K_REAL_CUR_PSTN 		0.087890625
// временной цикл процессора
#define TIME_CYCLE_CPU 		0.00011



//////////////// ОБЪЯВЛЕНИЕ ВНЕШНЕГО ДОСТУПА К ФУНКЦИЯМ /////////////////////
// объявление внешнего доступа к функции CalcVarblsSttng
extern void CalcVarblsSttng(Data_PMSM_S *md_motor_l);
//  объявление функции CalcFastVarblsSttng
extern void CalcFastVarblsSttng(Data_PMSM_S *md_motor_l);

#endif
