//###########################################################################
//
// Файл:    	MainExtrnlDevice.h
//
// Описание:   	Заголовочный файл MainExtrnlDevice.c
//
//###########################################################################


#ifndef MEASEXTRNLDEVICE_H_
#define MEASEXTRNLDEVICE_H_



////////////////////// ОБЪЯВЛЕНИЕ ИМЕНОВАННЫХ КОНСТАНТ //////////////////////
// сдвиг резольвера относительно абсолютного нуля для приведения к 0 ротора
#define	SHIFT_RES			230


//////////////// ОБЪЯВЛЕНИЕ ВНЕШНЕГО ДОСТУПА К ФУНКЦИЯМ /////////////////////
// объявление внешнего доступа к функции HandlrExtrnlFastDevice
extern void HandlrExtrnlFastDevice(Data_PMSM_S *md_motor_l);


#endif
