//###########################################################################
//
//FILE:   Smpl_table.h
//
//TITLE:  Table data function
//
//###########################################################################

#ifndef SMPL_TABL_H_
#define SMPL_TABL_H_

//////////////// ОБЪЯВЛЕНИЕ ВНЕШНЕГО ДОСТУПА К ЭЛЕМЕНТАМ МАССИВА /////////////////////
// объявление внешнего доступа к переменной Tabl_sin_90
extern const float32 Tabl_sin_90[91];
// объявление внешнего доступа к переменной SQRT175
extern const float32 SQRT175[177];
// объявление внешнего доступа к переменной Tabl_Im
extern const float32 Tabl_Im[18];


#endif
